Revit 2027 API
SweptProfile.StartSetBack Property
 The distance from the start of the driving curve to the point where the sweep actually begins.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartSetBack { get; }
Public ReadOnly Property StartSetBack As Double
	Get
public:
property double StartSetBack {
	double get ();
}
member StartSetBack : float with get
Property Value
Double
See Also
Reference
SweptProfile Class
Autodesk.Revit.DB Namespace